#include "PCA9685_Init.h"

void M_A_Init() {
    PCA_Set(Under, 0, 50, 0, 0); //0号舵机 - 最底下
    Delay_Ms(200);

    PCA_Set(RArm, 0, 20, 0, 0); //1号舵机 - 右边(后 大臂) 右边 趋近0后仰 趋近180前倾
    Delay_Ms(200);

    PCA_Set(LArm, 0, 90, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(200);

    PCA_Set(Hand, 0, 115, 0, 0); //3号舵机 - 手部 趋近0抓住 趋近180放手
    Delay_Ms(200);
}

/*
 *机械臂抓取函数
 * 张开手准备-->前伸-->抓取(合手)-->后仰归位
 * 这里需要大臂先动 小臂后动 不然的话会卡住小臂不往前伸
 */
void M_A_Catch() {
    PCA_Set(Hand, 0, 120, 0, 0); //3号舵机 - 手部 趋近0抓住 趋近180放手
    Delay_Ms(200); //这里张开手 准备抓取

    PCA_Set(Under, 0, 50, 0, 0); //0号舵机 - 最底下
    Delay_Ms(200);

    /********************前伸**********************/
    PCA_Set(RArm, 0, 40, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(500);

    PCA_Set(LArm, 0, 100, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(500);

    PCA_Set(RArm, 0, 90, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(500);

    /*********************************************/

    PCA_Set(Hand, 0, 95, 0, 0); //3号舵机 - 手部 趋近0抓住 趋近180放手
    Delay_Ms(200); //这里合上手 抓取

    /********************后仰**********************/
    //右大臂动作
    PCA_Set(RArm, 0, 80, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(400);

    PCA_Set(RArm, 0, 70, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(400);

    PCA_Set(RArm, 0, 55, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(400);

    PCA_Set(RArm, 0, 30, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(400);

    //左小臂动作
    PCA_Set(LArm, 0, 100, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(400);

    PCA_Set(LArm, 0, 90, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(400);

    PCA_Set(LArm, 0, 75, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(400);

    PCA_Set(LArm, 0, 60, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
    Delay_Ms(600);
    /*********************************************/

//    PCA_Set(Hand, 0, 120, 0, 0); //3号舵机 - 手部 趋近0抓住 趋近180放手
//    Delay_Ms(200);//放手
}

/*
 *  机械臂放下物品函数
 *  前伸-->放手
 */
void M_A_Put() {
    PCA_Set(Under, 0, 50, 0, 0); //0号舵机 - 最底下
    Delay_Ms(200);

    PCA_Set(RArm, 0, 40, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(500);

    PCA_Set(RArm, 0, 50, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(500);

//    PCA_Set(LArm, 0, 80, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
//    Delay_Ms(500);
//
//    PCA_Set(LArm, 0, 90, 0, 0); //2号舵机 - 左边(前 小臂) 趋近0前倾(向下) 趋近180后仰(向上)
//    Delay_Ms(500);

    /********转动到盒子位置再放下**********/
    PCA_Set(Under, 0, 55, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(300);

    PCA_Set(Under, 0, 60, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(300);

    PCA_Set(Under, 0, 65, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(300);

    PCA_Set(Under, 0, 70, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(300);
    /**********************/

    PCA_Set(Hand, 0, 120, 0, 0); //3号舵机 - 手部 趋近0抓住 趋近180放手
    Delay_Ms(200); //放手

    //放下后回到原位
    PCA_Set(Under, 0, 50, 0, 0); //1号舵机 - 右边(后 大臂) 趋近0后仰 趋近180前倾
    Delay_Ms(300);
}

void PCA9685_Active(void) {
    IIC_Init(80000, 0X0A);
    PCA9685_Init(50); //初始化PCA9685的PWM频率
    M_A_Init();
}
